{
  "backend/main.mo": "Motoko backend defining job post types, user profiles, access control, and CRUD operations with admin checks.",
  "feature_evidence.json": "JSON report mapping feature requirements to affected frontend files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or build planning.",
  "frontend/index.css": "Tailwind base and CSS variables defining color tokens and theme styling for light and dark mode.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all public and admin routes wrapped in layout, guards, and an error boundary.",
  "frontend/src/components/admin/AdminSettingsDialog.tsx": "Provides a dialog for viewing and saving the Gemini API key to localStorage.",
  "frontend/src/components/admin/blocks/ImageBannerBlockEditor.tsx": "Editor for image/banner block fields including URL, alt text, and a live preview.",
  "frontend/src/components/admin/blocks/LinkButtonBlockEditor.tsx": "Editor for link button blocks allowing editing of label text and target URL.",
  "frontend/src/components/admin/blocks/ParagraphBlockEditor.tsx": "Editor for paragraph blocks providing a textarea to update text content.",
  "frontend/src/components/admin/blocks/TableBlockEditor.tsx": "Provides a UI for editing table blocks, allowing row/column management and cell updates.",
  "frontend/src/components/admin/blocks/TitleBlockEditor.tsx": "Renders controls for editing a title block’s text and heading level.",
  "frontend/src/components/admin/DeleteJobPostDialog.tsx": "Confirmation dialog for deleting a job post, showing name and disabling actions during deletion.",
  "frontend/src/components/admin/JobPostBlocksEditor.tsx": "Editor for managing job post content blocks, allowing adding, reordering, deleting, and editing various block types.",
  "frontend/src/components/admin/JobPostForm.tsx": "Main form for creating or editing job posts, handling text fields, uploads, lists, links, and block-based content.",
  "frontend/src/components/admin/ManageDailyQuizPanel.tsx": "Admin panel to create, validate, and publish the daily quiz, with form inputs and status display.",
  "frontend/src/components/admin/PhotoUploadFabTool.tsx": "Floating tool for uploading images, storing them locally, previewing, and copying the image or HTML code.",
  "frontend/src/components/AiChatModal.tsx": "AI chat modal handling message display, Gemini API calls using a stored API key, and error states.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied or login required message, with a login button if unauthenticated.",
  "frontend/src/components/auth/AdminPasswordGateModal.tsx": "Modal prompting for the admin password and handling unlock logic with feedback.",
  "frontend/src/components/auth/AdminPasswordRequiredScreen.tsx": "Shows a locked admin access message and triggers the admin password modal.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking identity, admin status, and local unlock state before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with handling for authentication edge cases.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component rendering a fallback UI and reset button on runtime errors.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Renders floating WhatsApp, Telegram, and AI chat buttons and controls the AI chat modal state.",
  "frontend/src/components/home/DailyQuizSection.tsx": "Displays the daily quiz with options, selection handling, correctness feedback, and explanation.",
  "frontend/src/components/home/PreparationResourcesSection.tsx": "Shows preparation resources including books, courses, and test series using fetched data.",
  "frontend/src/components/home/QuickOfficialLinks.tsx": "Renders a list of official links with optional highlighting and external navigation.",
  "frontend/src/components/home/SimpleJobsSection.tsx": "Displays quick job listings filtered by search query and links to notifications.",
  "frontend/src/components/home/StudyCornerSection.tsx": "Shows study material categories with accordion UI and external links for resources.",
  "frontend/src/components/home/VerticalTickerList.tsx": "Creates an auto-scrolling vertical ticker with reduced-motion handling and pause on hover.",
  "frontend/src/components/JobDetails/ImportantLinksButtons.tsx": "Displays apply, notification, and website buttons with availability checks for a job post.",
  "frontend/src/components/JobDetails/JobDetailsTables.tsx": "Renders tables for important dates, fees, age limits, and other job details using dynamic post data.",
  "frontend/src/components/JobDetails/JobPostBlocksRenderer.tsx": "Renders job post content blocks including titles, paragraphs, links, images, and tables.",
  "frontend/src/components/JobDetails/JobPosterHero.tsx": "Displays a job poster image with fallback gradient header when the image is missing or fails.",
  "frontend/src/components/JobDetails/UsefulImportantLinksTable.tsx": "Shows a table of admit card, syllabus, notification, and website links with availability indicators.",
  "frontend/src/components/MotivationalBanner.tsx": "Shows a static motivational banner with stylized text.",
  "frontend/src/components/RootLayout.tsx": "Defines the main site layout with header, navigation, search, theme toggle, modals, and global wrappers.",
  "frontend/src/components/SiteNoticeTicker.tsx": "Displays a scrolling marquee notice ticker with repeated announcement text.",
  "frontend/src/contexts/JobSearchContext.tsx": "Provides context for storing and updating the job search query throughout the app.",
  "frontend/src/features/dailyQuiz/dailyQuizStore.ts": "Manages daily quiz data in localStorage, including publish, retrieve, and clear operations.",
  "frontend/src/features/homeCards/homeCardsStore.ts": "Handles CRUD and persistence for home card items with default seeded entries.",
  "frontend/src/features/officialLinks/officialLinksStore.ts": "Manages official links list with CRUD, reordering, and initial default seeding in localStorage.",
  "frontend/src/features/preparationResources/preparationResourcesStore.ts": "Stores and updates preparation resources like books and test series with full CRUD support.",
  "frontend/src/features/simpleJobs/simpleJobsStore.ts": "Manages simple job listings with add, delete, and localStorage persistence.",
  "frontend/src/features/studyCorner/studyCornerStore.ts": "Tracks study categories and items with CRUD operations and default preset content.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to user identity, refreshing queries on change.",
  "frontend/src/hooks/useAdmitCardPosts.ts": "Fetches admit card job posts via react-query using the actor API.",
  "frontend/src/hooks/useClientAdminAuth.ts": "Manages client admin unlock state in localStorage with login/logout helpers.",
  "frontend/src/hooks/useDailyQuiz.ts": "Subscribes to daily quiz data in localStorage and exposes publish functionality.",
  "frontend/src/hooks/useHomeCards.ts": "Provides CRUD operations for home card items stored in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth state, login, logout, and context provider setup.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks if the current authenticated identity is an admin via actor API.",
  "frontend/src/hooks/useJobPost.ts": "Fetches a single job post by ID through the actor using react-query.",
  "frontend/src/hooks/useJobPostMutations.ts": "Provides add, update, and delete mutations for job posts and invalidates related queries.",
  "frontend/src/hooks/useJobPosts.ts": "Fetches job posts filtered by category via actor API.",
  "frontend/src/hooks/useOfficialLinks.ts": "Manages official links list in localStorage with CRUD and reorder operations.",
  "frontend/src/hooks/usePreparationResources.ts": "Handles books and test series resources in localStorage with full CRUD operations.",
  "frontend/src/hooks/useSimpleJobs.ts": "Manages simple job entries stored in localStorage with add/remove operations.",
  "frontend/src/hooks/useStudyCorner.ts": "Manages study categories and items in localStorage with CRUD operations.",
  "frontend/src/hooks/useSyllabusRepository.ts": "Fetches syllabus-related job posts through the actor API.",
  "frontend/src/hooks/useThemePreference.ts": "Controls light/dark theme preference with localStorage persistence.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, theming, and custom styles including KBC quiz UI.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with forms and dialogs to manage official links, study corner categories/items, daily quiz, and settings using various hooks and toast alerts.",
  "frontend/src/pages/admin/AdminEditJobPostPage.tsx": "Page for creating or editing a job post, loading existing data when editing and submitting via job post mutation hooks.",
  "frontend/src/pages/admin/AdminPostsPage.tsx": "Admin interface to list, create, edit, and delete job posts with confirmation dialogs and category labeling.",
  "frontend/src/pages/AdmitCardHallPage.tsx": "Displays and filters admit card posts with loading, error, and empty states, showing status and links for each post.",
  "frontend/src/pages/CheckYourAgePage.tsx": "Provides an age calculator allowing users to input dates and view computed years, months, and days with validation.",
  "frontend/src/pages/ClientAdminPage.tsx": "Implements a password-protected admin panel for managing jobs, links, home cards, preparation resources, and API keys.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with categorized job sections, fallback items, search filtering, and multiple featured components.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows detailed job post information including hero banner, content blocks, links, and tables with full loading and error states.",
  "frontend/src/pages/SyllabusRepositoryPage.tsx": "Lists syllabus posts with search, status indicators, and direct download links along with loading and error handling.",
  "frontend/src/utils/linkAvailability.ts": "Utility returning availability status and label based on whether a URL is present.",
  "frontend/src/utils/localStorageStore.ts": "LocalStorage wrapper providing key-scoped listeners, snapshot caching, and reactive get/set behavior.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, fonts, animations, and plugin usage.",
  "project_state.json": "Defines project state for adding an Admin Dashboard settings modal to store a Gemini API key in localStorage, including existing features and a pending request. Contains metadata, architectural notes, and versioned feature entries."
}