{
  "backend/main.mo": "Defines types and CRUD logic for job posts, user profiles, and access control, including admin-protected post creation and profile management.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of various frontend files and components.",
  "frontend/index.css": "Sets global Tailwind layers and OKLCH-based design tokens for light/dark themes and shared styling rules.",
  "frontend/index.html": "Basic HTML root document that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all pages including admin and client-admin areas wrapped in an error boundary.",
  "frontend/src/components/admin/blocks/ImageBannerBlockEditor.tsx": "Editor block for setting an image URL and alt text with a live preview.",
  "frontend/src/components/admin/blocks/LinkButtonBlockEditor.tsx": "Block editor for configuring a button label and its target URL.",
  "frontend/src/components/admin/blocks/ParagraphBlockEditor.tsx": "Block editor allowing input of paragraph text content.",
  "frontend/src/components/admin/blocks/TableBlockEditor.tsx": "Editor for creating and modifying table rows, columns, and cell values with optional title.",
  "frontend/src/components/admin/blocks/TitleBlockEditor.tsx": "Block editor for entering heading text and selecting H2 or H3 level.",
  "frontend/src/components/admin/DeleteJobPostDialog.tsx": "Provides a confirmation dialog for permanently deleting a job post with disable states.",
  "frontend/src/components/admin/JobPostBlocksEditor.tsx": "Allows admins to add, edit, rearrange, and delete structured content blocks for job posts.",
  "frontend/src/components/admin/JobPostForm.tsx": "Form component for creating or editing job posts with fields for images, dates, fees, vacancies, links, and custom blocks.",
  "frontend/src/components/admin/PhotoUploadFabTool.tsx": "Floating tool for uploading an image, storing it in localStorage, previewing it, and copying its data URL or HTML snippet.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied or login required message with optional login button.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks authentication and admin status before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that shows a fallback UI and reset button when runtime errors occur.",
  "frontend/src/components/home/PreparationResourcesSection.tsx": "Home page section presenting study resources with links to books and courses.",
  "frontend/src/components/home/QuickOfficialLinks.tsx": "Renders a card listing official links from a hook, showing highlighted links with styled buttons and fallback text if empty.",
  "frontend/src/components/home/SimpleJobsSection.tsx": "Displays a list of quick job updates with title, category, last date, and a notification link, hidden if no jobs exist.",
  "frontend/src/components/home/StudyCornerSection.tsx": "Shows study material categories in an accordion with items linking to resources, falling back to messages when empty.",
  "frontend/src/components/home/VerticalTickerList.tsx": "Creates a vertically scrolling ticker with pause-on-hover and reduced-motion support by duplicating content for looping.",
  "frontend/src/components/JobDetails/ImportantLinksButtons.tsx": "Renders three major job action buttons with availability checks and fallback states based on link status.",
  "frontend/src/components/JobDetails/JobDetailsTables.tsx": "Renders multiple tables showing important dates, fees, age limits, and other job post details using data from a JobPost object.",
  "frontend/src/components/JobDetails/JobPostBlocksRenderer.tsx": "Displays dynamic job post content blocks including titles, paragraphs, links, images, and tables.",
  "frontend/src/components/JobDetails/JobPosterHero.tsx": "Shows a job poster image with fallback gradient styling when the image is missing or fails to load.",
  "frontend/src/components/JobDetails/UsefulImportantLinksTable.tsx": "Generates a table of important job-related links with availability status and download actions.",
  "frontend/src/components/MotivationalBanner.tsx": "Displays a simple motivational banner with Hindi text.",
  "frontend/src/components/RootLayout.tsx": "Defines the main site layout with header, navigation, login, admin links, and content outlet.",
  "frontend/src/components/SiteNoticeTicker.tsx": "Shows a scrolling marquee notice with repeated update text and an animated bell icon.",
  "frontend/src/features/homeCards/homeCardsStore.ts": "Manages home card items in localStorage with CRUD operations and default seeded data.",
  "frontend/src/features/officialLinks/officialLinksStore.ts": "Stores and manages official links in localStorage, supporting CRUD and drag-based reordering.",
  "frontend/src/features/simpleJobs/simpleJobsStore.ts": "Handles simple job entries in localStorage with add, fetch, and delete operations.",
  "frontend/src/features/studyCorner/studyCornerStore.ts": "Manages study categories and items in localStorage with defaults and full CRUD for categories and items.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, auto-refreshing dependent queries on change.",
  "frontend/src/hooks/useAdmitCardPosts.ts": "Fetches admit card posts from the backend actor using React Query when the actor is ready.",
  "frontend/src/hooks/useClientAdminAuth.ts": "Provides a simple localStorage‑based admin unlock mechanism with login and logout functions.",
  "frontend/src/hooks/useHomeCards.ts": "Exposes home card items via a reactive store with methods to add, update, and delete entries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status states.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks if the authenticated user is an admin by querying the actor, integrating identity and actor loading states.",
  "frontend/src/hooks/useJobPost.ts": "Fetches a single job post by ID from the backend actor with error handling and caching.",
  "frontend/src/hooks/useJobPostMutations.ts": "Defines add, update, and delete mutations for job posts and invalidates related queries on success.",
  "frontend/src/hooks/useJobPosts.ts": "Loads job posts filtered by category using the backend actor with caching support.",
  "frontend/src/hooks/useOfficialLinks.ts": "Manages official links stored in localStorage, providing add, update, delete, and reorder helpers.",
  "frontend/src/hooks/useSimpleJobs.ts": "Manages a simple jobs list in localStorage with functions to add and remove jobs.",
  "frontend/src/hooks/useStudyCorner.ts": "Handles study categories and items stored in localStorage with full CRUD operations.",
  "frontend/src/hooks/useSyllabusRepository.ts": "Fetches the syllabus repository job posts from the backend actor with caching.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, theme variables, typography, accessibility tweaks, and custom UI utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard providing panels for managing job posts, official links, study corner items, and other admin tools.",
  "frontend/src/pages/admin/AdminEditJobPostPage.tsx": "Admin page for creating or editing a job post using a form, with save logic and navigation handling.",
  "frontend/src/pages/admin/AdminPostsPage.tsx": "Admin interface for listing, creating, editing, and deleting job posts with dialogs and navigation.",
  "frontend/src/pages/AdmitCardHallPage.tsx": "Displays a list of admit card posts with loading, error, and empty states, including link status indicators.",
  "frontend/src/pages/ClientAdminPage.tsx": "Admin login and panel allowing management of simple jobs, official links, and home card items with add, edit, and delete actions.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying categorized job sections with backend and fallback items, plus official links and study resources.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays full job post details including hero banner, blocks, tables, and important links with loading and error states.",
  "frontend/src/pages/SyllabusRepositoryPage.tsx": "Lists syllabus PDFs with availability checks, loading states, and links to related job posts.",
  "frontend/src/utils/linkAvailability.ts": "Provides a helper that returns availability status and label based on whether a URL is non-empty.",
  "frontend/src/utils/localStorageStore.ts": "Implements a reactive localStorage wrapper with key‑scoped listeners, snapshot caching, and change notifications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, fonts, and enabled plugins.",
  "project_state.json": "Metadata describing project requirements, feature requests, and admin login password/security rules."
}