{
  "backend/main.mo": "Main canister actor defining job posts, schemes, user profiles, and admin-protected CRUD APIs with access control and authorization mixins.",
  "backend/migration.mo": "Migration module that upgrades canister state by preserving existing data and marking access control as initialized.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test coverage.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based CSS defining color tokens, dark mode variables, and base styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration defining public and admin-protected routes wrapped with AdminRouteGuard.",
  "frontend/src/components/admin/AdminSettingsDialog.tsx": "Provides a settings dialog allowing admins to view and save a Gemini API key stored in localStorage.",
  "frontend/src/components/admin/AdminUnlockInlineForm.tsx": "Renders an inline admin login form that checks a hardcoded password and toggles dashboard visibility via DOM updates and localStorage.",
  "frontend/src/components/admin/blocks/ImageBannerBlockEditor.tsx": "Editor for an image banner block allowing URL, alt text entry, and live preview.",
  "frontend/src/components/admin/blocks/LinkButtonBlockEditor.tsx": "Editor for a button-style link block with fields for label text and URL.",
  "frontend/src/components/admin/blocks/ParagraphBlockEditor.tsx": "Simple paragraph text editor using a textarea to update block content.",
  "frontend/src/components/admin/blocks/TableBlockEditor.tsx": "Interactive table editor supporting title input, cell editing, and adding/removing rows and columns.",
  "frontend/src/components/admin/blocks/TitleBlockEditor.tsx": "Editor for title blocks allowing heading level selection and text entry.",
  "frontend/src/components/admin/DeleteJobPostDialog.tsx": "Shows a confirmation dialog for deleting a job post, with support for loading state during deletion.",
  "frontend/src/components/admin/JobPostBlocksEditor.tsx": "Enables adding, removing, reordering, and editing structured content blocks for job posts using various block-specific editors.",
  "frontend/src/components/admin/JobPostForm.tsx": "Provides a comprehensive form for creating or editing job posts, including images, dates, fees, vacancies, links, and block-based content.",
  "frontend/src/components/admin/ManageDailyQuizPanel.tsx": "Allows admins to create and publish a daily quiz question with options, correct answer, and explanation.",
  "frontend/src/components/admin/PhotoUploadFabTool.tsx": "Offers a floating image upload tool that stores uploaded images in localStorage and provides copyable links or HTML snippets.",
  "frontend/src/components/AiChatModal.tsx": "AI chat modal handling user messages, Gemini API calls, and interactive chat UI with loading states.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays access-denied or login-required messaging with optional login button.",
  "frontend/src/components/auth/AdminAuthLoadingScreen.tsx": "Loading screen shown while verifying admin authentication state.",
  "frontend/src/components/auth/AdminPasswordGateModal.tsx": "Empty file.",
  "frontend/src/components/auth/AdminPasswordRequiredScreen.tsx": "Empty file.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks authentication and admin status before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and admin session cleanup.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a fallback card and reset button when rendering fails.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Floating WhatsApp, Telegram, and AI chat buttons with a modal trigger.",
  "frontend/src/components/home/DailyQuizSection.tsx": "Displays the daily quiz with selectable options, feedback, and optional explanation.",
  "frontend/src/components/home/PreparationResourcesSection.tsx": "Section listing preparation resources including books, courses, and test series.",
  "frontend/src/components/home/QuickOfficialLinks.tsx": "Renders a list of official links with highlight support and external link buttons.",
  "frontend/src/components/home/SarkariSchemesSection.tsx": "Displays government schemes with Rajasthan/India tabs, filtering, loading states, and apply-now links.",
  "frontend/src/components/home/SimpleJobsSection.tsx": "Shows a searchable list of quick job updates with categories, last dates, and notification links.",
  "frontend/src/components/home/StudyCornerSection.tsx": "Renders study material categories in an accordion with external links to resources.",
  "frontend/src/components/home/VerticalTickerList.tsx": "Creates a vertical scrolling ticker with pause-on-hover and reduced-motion fallback.",
  "frontend/src/components/JobDetails/ImportantLinksButtons.tsx": "Renders Apply, Notification, and Official Website buttons with availability checks.",
  "frontend/src/components/JobDetails/JobDetailsTables.tsx": "Displays job details such as important dates, fees, age limits, and syllabus link in tables.",
  "frontend/src/components/JobDetails/JobPostBlocksRenderer.tsx": "Renders job post content blocks including titles, paragraphs, images, links, and tables.",
  "frontend/src/components/JobDetails/JobPosterHero.tsx": "Shows a job poster image with fallback gradient banner when image is unavailable.",
  "frontend/src/components/JobDetails/UsefulImportantLinksTable.tsx": "Table of important job-related links like admit card, syllabus, notification, and website with status indicators.",
  "frontend/src/components/MotivationalBanner.tsx": "Static motivational banner with Hindi text.",
  "frontend/src/components/RootLayout.tsx": "Main layout containing header, navigation, search, theme toggling, and global wrappers.",
  "frontend/src/components/SiteNoticeTicker.tsx": "Displays a scrolling marquee ticker with repeating site notice text and an animated bell icon.",
  "frontend/src/contexts/JobSearchContext.tsx": "Provides context for storing and updating a global job search query.",
  "frontend/src/features/dailyQuiz/dailyQuizStore.ts": "Manages daily quiz data in localStorage, including publish, fetch, and clear functions.",
  "frontend/src/features/homeCards/homeCardsStore.ts": "Stores home card items in localStorage with default seeding and CRUD operations.",
  "frontend/src/features/officialLinks/officialLinksStore.ts": "Handles official links list in localStorage with CRUD and reordering support.",
  "frontend/src/features/preparationResources/preparationResourcesStore.ts": "Maintains preparation resources (books and test series) in localStorage with CRUD helpers.",
  "frontend/src/features/simpleJobs/simpleJobsStore.ts": "Stores simple job entries in localStorage with functions to add, list, and delete jobs.",
  "frontend/src/features/studyCorner/studyCornerStore.ts": "Manages study categories and items in localStorage with CRUD helpers for categories and items.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdmitCardPosts.ts": "Fetches admit card job posts using the backend actor with react-query.",
  "frontend/src/hooks/useClientAdminAuth.ts": "Handles client-side admin unlock using a hardcoded password with localStorage and sessionStorage sync.",
  "frontend/src/hooks/useDailyQuiz.ts": "Subscribes to and publishes the daily quiz state stored in localStorage.",
  "frontend/src/hooks/useHomeCards.ts": "Provides localStorage-backed CRUD operations for home card items.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and loading logic using Dfinity AuthClient.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries backend admin status using the actor, considering identity and client-side unlock state.",
  "frontend/src/hooks/useJobPost.ts": "Fetches a single job post by ID via the backend actor with error handling.",
  "frontend/src/hooks/useJobPostMutations.ts": "Provides mutations to add, update, and delete job posts and invalidates related queries.",
  "frontend/src/hooks/useJobPosts.ts": "Fetches job posts filtered by category using the backend actor.",
  "frontend/src/hooks/useOfficialLinks.ts": "Manages official links in localStorage with CRUD and reorder operations.",
  "frontend/src/hooks/usePreparationResources.ts": "Handles preparation resources in localStorage, providing CRUD for books and test series.",
  "frontend/src/hooks/useSchemeMutations.ts": "Exposes mutations to add, update, and delete schemes with UI toasts and query invalidation.",
  "frontend/src/hooks/useSchemes.ts": "Fetches all schemes from the backend actor using react-query.",
  "frontend/src/hooks/useSimpleJobs.ts": "Provides a hook to read and modify simple jobs stored in localStorage using an external store.",
  "frontend/src/hooks/useStudyCorner.ts": "Offers a hook for managing study categories and items with add, update, and delete operations synced to localStorage.",
  "frontend/src/hooks/useSyllabusRepository.ts": "Fetches syllabus repository job posts via react-query using an authenticated actor.",
  "frontend/src/hooks/useThemePreference.ts": "Stores and toggles light/dark theme preference and syncs it with localStorage and DOM classes.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive custom light/dark theme variables plus KBC quiz UI styles.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, importing global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard toggling between login and unlocked views with management tools for links, study items, and schemes.",
  "frontend/src/pages/admin/AdminEditJobPostPage.tsx": "Admin page to create or edit job posts using a form, with save mutations and guarded access.",
  "frontend/src/pages/admin/AdminPostsPage.tsx": "Admin interface listing job posts with options to create, edit, and delete, including confirmation dialogs.",
  "frontend/src/pages/AdmitCardHallPage.tsx": "Displays admit card posts with search filtering, loading states, error handling, and link status indicators.",
  "frontend/src/pages/CheckYourAgePage.tsx": "Provides an age calculator UI that computes years, months, and days between two dates.",
  "frontend/src/pages/ClientAdminPage.tsx": "Implements an admin login and management panel for jobs, links, cards, resources, and API key storage.",
  "frontend/src/pages/HomePage.tsx": "Renders home sections combining backend and fallback items, with search filtering and multiple feature sections.",
  "frontend/src/pages/PostDetailPage.tsx": "Page fetching a job post by ID and rendering hero, content blocks, links, and detail tables with loading and error states.",
  "frontend/src/pages/SyllabusRepositoryPage.tsx": "Displays a searchable list of posts with syllabus downloads, handling loading, errors, and link availability.",
  "frontend/src/utils/linkAvailability.ts": "Utility returning availability status and label based on whether a URL exists.",
  "frontend/src/utils/localStorageStore.ts": "LocalStorage wrapper providing key-specific subscriptions, cached snapshots, and safe get/set operations.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, fonts, animations, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, known issues about admin access handling, and feature requests related to fixing admin authorization and UX behavior."
}