{
  "backend/main.mo": "Actor canister defining job posts, schemes, user profiles, and admin‑protected CRUD operations with access‑control mixin.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend files describing routing, pages, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base layer defining OKLCH design tokens, light/dark theme variables, and global background/text styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all public and admin routes wrapped in AdminRouteGuard and handled via RootLayout and ErrorBoundary.",
  "frontend/src/components/admin/AdminSettingsDialog.tsx": "Dialog for viewing and updating the stored Gemini API key.",
  "frontend/src/components/admin/AdminUnlockInlineForm.tsx": "Inline admin login form that validates a password and triggers authentication.",
  "frontend/src/components/admin/blocks/ImageBannerBlockEditor.tsx": "Editor for setting an image URL and alt text with a live preview.",
  "frontend/src/components/admin/blocks/LinkButtonBlockEditor.tsx": "Editor for configuring a button label and destination URL.",
  "frontend/src/components/admin/blocks/ParagraphBlockEditor.tsx": "Simple paragraph text editor using a textarea.",
  "frontend/src/components/admin/blocks/TableBlockEditor.tsx": "Interactive table editor supporting row/column add/remove and cell editing.",
  "frontend/src/components/admin/blocks/TitleBlockEditor.tsx": "Heading editor allowing switching between H2/H3 and editing the text.",
  "frontend/src/components/admin/DeleteJobPostDialog.tsx": "Confirmation dialog for permanently deleting a job post.",
  "frontend/src/components/admin/JobPostBlocksEditor.tsx": "Editor for adding, removing, reordering, and modifying content blocks in a job post.",
  "frontend/src/components/admin/JobPostForm.tsx": "Form for creating or editing a job post, including metadata, images, fees, vacancies, and content blocks.",
  "frontend/src/components/admin/ManageDailyQuizPanel.tsx": "Panel for creating, validating, and publishing the daily quiz question.",
  "frontend/src/components/admin/PhotoUploadFabTool.tsx": "Floating tool for uploading an image, previewing it, and copying its data URL or HTML snippet.",
  "frontend/src/components/AiChatModal.tsx": "AI chat modal component handling message state, Gemini API calls, auto‑scrolling, and admin‑configured API key access.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied or login-required message with optional login button.",
  "frontend/src/components/auth/AdminPasswordGateModal.tsx": "Empty file.",
  "frontend/src/components/auth/AdminPasswordRequiredScreen.tsx": "Empty file.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks authentication and admin status before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and clearing admin session.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a styled fallback UI and reset button when child components throw errors.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Renders floating buttons for WhatsApp, Telegram, and an AI chat modal trigger.",
  "frontend/src/components/home/DailyQuizSection.tsx": "Displays the daily quiz with selectable options, correctness feedback, and explanation.",
  "frontend/src/components/home/PreparationResourcesSection.tsx": "Shows preparation resources including books, courses, and test series.",
  "frontend/src/components/home/QuickOfficialLinks.tsx": "Lists official external links with highlight support.",
  "frontend/src/components/home/SarkariSchemesSection.tsx": "Displays government schemes with Rajasthan/India tabs, fetching and filtering schemes and rendering a list with loading and error states.",
  "frontend/src/components/home/SimpleJobsSection.tsx": "Shows quick job updates filtered by search query, rendering job cards with notification links.",
  "frontend/src/components/home/StudyCornerSection.tsx": "Renders study material categories in an accordion, linking to PDFs or external resources.",
  "frontend/src/components/home/VerticalTickerList.tsx": "Implements a vertical auto-scrolling ticker with reduced-motion support and pause on hover/focus.",
  "frontend/src/components/JobDetails/ImportantLinksButtons.tsx": "Shows apply, notification, and official website buttons with availability-based states for a job post.",
  "frontend/src/components/JobDetails/JobDetailsTables.tsx": "Displays job details tables including important dates, fees, age limits, and syllabus availability.",
  "frontend/src/components/JobDetails/JobPostBlocksRenderer.tsx": "Renders dynamic job post content blocks such as titles, paragraphs, links, images, and tables.",
  "frontend/src/components/JobDetails/JobPosterHero.tsx": "Displays a job poster image with fallback gradient banner showing the job name.",
  "frontend/src/components/JobDetails/UsefulImportantLinksTable.tsx": "Shows a table of useful links like admit card, syllabus, and notification with availability handling.",
  "frontend/src/components/MotivationalBanner.tsx": "Simple motivational banner displaying a Hindi motivational phrase.",
  "frontend/src/components/RootLayout.tsx": "Main layout with header, navigation, search, theme toggle, and global wrappers for routing and UI.",
  "frontend/src/components/SiteNoticeTicker.tsx": "Displays a scrolling marquee notice with an animated bell icon.",
  "frontend/src/contexts/JobSearchContext.tsx": "Provides a context storing a job search query with setter for filtering job lists.",
  "frontend/src/features/dailyQuiz/dailyQuizStore.ts": "Manages daily quiz data in localStorage with get, publish, and clear helpers.",
  "frontend/src/features/homeCards/homeCardsStore.ts": "Stores and manages home card items in localStorage with CRUD functions and default seeding.",
  "frontend/src/features/officialLinks/officialLinksStore.ts": "Handles official links storage with CRUD and reordering, initializing from defaults if absent.",
  "frontend/src/features/preparationResources/preparationResourcesStore.ts": "Stores study resources (books and test series) in localStorage with CRUD operations for each.",
  "frontend/src/features/simpleJobs/simpleJobsStore.ts": "Manages simple job entries in localStorage with add, delete, and retrieval functions.",
  "frontend/src/features/studyCorner/studyCornerStore.ts": "Manages study categories and items using localStorage with CRUD helpers for categories and items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAdmitCardPosts.ts": "Fetches admit card job posts from the backend actor using react-query.",
  "frontend/src/hooks/useClientAdminAuth.ts": "Handles client-side admin unlock via password, storing unlock state and session token in localStorage/sessionStorage.",
  "frontend/src/hooks/useDailyQuiz.ts": "Provides access to the daily quiz stored in localStorage with publish functionality.",
  "frontend/src/hooks/useHomeCards.ts": "Syncs home card items from localStorage and provides CRUD operations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state and login/clear functions.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks backend admin status based on actor and identity, factoring in client-side admin unlock state.",
  "frontend/src/hooks/useJobPost.ts": "Fetches a single job post by ID from the backend actor.",
  "frontend/src/hooks/useJobPostMutations.ts": "Provides add, update, and delete mutations for job posts and invalidates related queries.",
  "frontend/src/hooks/useJobPosts.ts": "Fetches job posts filtered by category from the backend actor.",
  "frontend/src/hooks/useOfficialLinks.ts": "Manages official links stored in localStorage with CRUD and reorder operations.",
  "frontend/src/hooks/usePreparationResources.ts": "Handles preparation resources (books and test series) via localStorage with CRUD operations.",
  "frontend/src/hooks/useSchemeMutations.ts": "Provides add, update, and delete mutations for schemes with query invalidation and toast notifications.",
  "frontend/src/hooks/useSchemes.ts": "Fetches schemes from the backend actor using react-query.",
  "frontend/src/hooks/useSimpleJobs.ts": "Hook subscribing to simple jobs in localStorage and providing add/remove helpers.",
  "frontend/src/hooks/useStudyCorner.ts": "Hook managing study categories and items stored in localStorage with CRUD functions.",
  "frontend/src/hooks/useSyllabusRepository.ts": "Hook fetching syllabus repository posts via react-query using an actor.",
  "frontend/src/hooks/useThemePreference.ts": "Hook managing theme state, syncing with localStorage and toggling dark mode class.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and KBC quiz styles.",
  "frontend/src/main.tsx": "App entry mounting React root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides the admin dashboard with management panels for links, study corner, and schemes, gated by admin authentication.",
  "frontend/src/pages/admin/AdminEditJobPostPage.tsx": "Allows admins to create or edit job posts using a form, handling save operations and navigation.",
  "frontend/src/pages/admin/AdminPostsPage.tsx": "Shows a list of job posts for admins with options to create, edit, or delete items.",
  "frontend/src/pages/AdmitCardHallPage.tsx": "Page listing admit card posts with search, loading/error states, and link status display.",
  "frontend/src/pages/CheckYourAgePage.tsx": "Page providing an age calculator from DOB and comparison date with validation.",
  "frontend/src/pages/ClientAdminPage.tsx": "Admin interface for managing jobs, links, cards, resources, and API key with login gate.",
  "frontend/src/pages/HomePage.tsx": "Home page aggregating job posts, fallback items, and various sections with search filtering.",
  "frontend/src/pages/PostDetailPage.tsx": "Renders a job post detail page with loading, error, and full post display including hero, content blocks, links, and details tables.",
  "frontend/src/pages/SyllabusRepositoryPage.tsx": "Displays a searchable list of syllabus posts with loading/error states and direct PDF download links.",
  "frontend/src/utils/linkAvailability.ts": "Provides a simple utility to determine if a link is available and return a status label.",
  "frontend/src/utils/localStorageStore.ts": "Implements a key-scoped reactive localStorage wrapper with caching and subscription support for specific keys.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL/query parameters, store and retrieve them from sessionStorage, and manage persisted URL-driven state.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, and container settings using multiple plugins.",
  "project_state.json": "Defines project state, requirements, and issues for implementing a visible in-page Admin Panel login flow and conditional dashboard access."
}