{
  "kind": "build_request",
  "title": "Fix Admin Panel access flow with password login modal, localStorage persistence, and logout",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Change the Admin Panel access UX so clicking the \"Admin Panel\" tab never immediately shows an \"Access Denied\" screen; instead, it must immediately open a popup/modal that asks the user to enter an admin password.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "When I click the 'Admin Panel' tab, do NOT show the 'Access Denied' message immediately.\n​Instead, trigger a Popup/Modal asking: 'Enter Admin Password'."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to the Admin Panel route/tab does not render an \"Access Denied\" message as the first step when the admin session is not unlocked.",
        "A modal opens automatically on entry to the Admin Panel when the admin session is not unlocked.",
        "The modal includes user-facing text in English and includes the prompt text: \"Enter Admin Password\".",
        "The password input is type=\"password\" (masked/dots)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement client-side admin authentication using the exact password string \"@ni#ra&j*gurja:r\" and store the session flag using localStorage.setItem('isAdmin','true') on successful login; if the password is incorrect, show an alert with the exact text \"Wrong Password!\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "When I click 'Login', check the password against this exact string: @ni#ra&j*gurja&j*gurja:r\n​If Correct:\n​Set localStorage.setItem('isAdmin', 'true').\n​...\n​If Wrong: Show an alert 'Wrong Password!'."
        ]
      },
      "acceptanceCriteria": [
        "The login modal has a primary action labeled \"Login\".",
        "On clicking \"Login\" with the exact password \"@ni#ra&j*gurja:r\", the app calls localStorage.setItem('isAdmin','true') and closes/hides the modal.",
        "On clicking \"Login\" with any other password, the app shows a browser alert with exactly: \"Wrong Password!\" and does not set localStorage.isAdmin to true.",
        "No inline \"Access Denied\" message is shown as the wrong-password error state (use only the requested alert)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add persistence on page load for the Admin Panel: if localStorage 'isAdmin' is the string 'true', show the Admin Panel dashboard directly; otherwise show the login modal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "On page load, check if isAdmin is 'true' in Local Storage.\n​If true, show the Dashboard directly.\n​If false, show the Login Modal."
        ]
      },
      "acceptanceCriteria": [
        "With localStorage.getItem('isAdmin') === 'true', entering/reloading the Admin Panel shows the dashboard content immediately and does not open the login modal.",
        "With localStorage.getItem('isAdmin') missing or not equal to 'true', entering/reloading the Admin Panel opens the login modal automatically."
      ]
    },
    {
      "id": "REQ-4",
      "text": "After successful login, reveal the Admin Panel dashboard actions (including \"Job Posts\", \"Quiz\", and \"Settings\") and add a small \"Logout\" button in the top-right of the Admin Panel that clears the admin session by removing/resetting localStorage 'isAdmin' and returns the Admin Panel to the locked state (login modal shown on next view).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Reveal the Dashboard (Job Posts, Quiz, Settings buttons).\n...\nAdd a small 'Logout' button in the top-right corner of the Admin Panel to clear the session."
        ]
      },
      "acceptanceCriteria": [
        "After a successful admin password login, the Admin Panel shows dashboard options including: \"Job Posts\", \"Quiz\", and \"Settings\".",
        "A \"Logout\" button is visible in the Admin Panel top-right area while logged in.",
        "Clicking \"Logout\" clears the localStorage 'isAdmin' flag (so localStorage.getItem('isAdmin') is no longer 'true') and returns the Admin Panel to the locked state (modal required again)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead of modifying UI primitives).",
    "Use English for all user-facing text.",
    "Use the exact admin password string provided by the user without modifications: @ni#ra&j*gurja:r.",
    "Use localStorage key exactly 'isAdmin' with value exactly 'true' for the admin session flag."
  ],
  "nonGoals": [
    "Do not implement or change Internet Identity authentication in this request.",
    "Do not add any backend/admin-role changes in Motoko for this request (client-side gating only, per user instructions).",
    "Do not add new admin features beyond the requested login modal flow, persistence, and logout."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}