{
  "kind": "build_request",
  "title": "Fix incorrect 'Access Denied' when accessing admin job post management",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the admin route guard so it does not show the 'Access Denied' screen while the admin-status check is still loading; instead, render a clear loading state until `useIsAdmin()` has resolved (success or error).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Access Denied\nYou do not have permission to access this page. Only administrators can manage job posts.\nइस एरर को ठीक करो जल्दी से जल्दी"
        ]
      },
      "acceptanceCriteria": [
        "When a logged-in administrator navigates to `/admin`, `/admin/dashboard`, `/admin/posts`, or `/admin/posts/:id/edit`, the UI does not flash or get stuck on the 'Access Denied' message during the initial admin check.",
        "While `useIsAdmin()` is loading, the route guard shows a dedicated loading UI (not 'Access Denied').",
        "After the admin check resolves true, the protected page renders normally without requiring a manual refresh."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure backend admin authorization is correctly bootstrap-able so legitimate administrators are not permanently treated as non-admins (e.g., add an explicit admin bootstrap/management API that can be invoked safely to grant admin to a principal, with strict access control to prevent privilege escalation).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Only administrators can manage job posts."
        ]
      },
      "acceptanceCriteria": [
        "There is a documented, testable way to make at least one principal an admin after deployment without editing canister state manually.",
        "Once a principal is granted admin, `isAdmin()` returns true for that principal and job post CRUD (`addJobPost`, `updateJobPost`, `deleteJobPost`) succeeds for that principal.",
        "Non-admin principals cannot grant themselves (or others) admin privileges."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the admin access-denied UX to guide the user when they are logged in but not an admin: keep the existing English message but add a clear next step (e.g., sign out and sign in with the admin identity, or contact the administrator).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "You do not have permission to access this page. Only administrators can manage job posts."
        ]
      },
      "acceptanceCriteria": [
        "If a user is authenticated but not an admin, the access denied screen provides a clear English next-step instruction.",
        "If a user is not authenticated, the screen continues to show the login-required UI with the login button."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep all Motoko backend logic in backend/main.mo (single-actor architecture)."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers; only Internet Identity is allowed.",
    "Do not add new admin product features beyond fixing the permission/role check flow and providing a safe admin bootstrap path."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}