{
  "kind": "build_request",
  "title": "Add Admin Dashboard Settings modal to store Gemini API key in localStorage",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new, visually distinct button labeled \"⚙️ Settings\" to the Admin Dashboard main action area (the same grid/list area where the existing admin actions like \"Job Posts\" and \"📢 Manage Quiz\" are accessed). The button must use a grey/black styling so it is clearly different from the other admin action buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Inside the Admin Dashboard grid (where 'Job Posts' and 'Manage Quiz' buttons are), add a new button labeled '⚙️ Settings'. Make it distinct (e.g., Grey or Black color)."
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard shows a new button labeled \"⚙️ Settings\" alongside the existing admin action entries.",
        "The \"⚙️ Settings\" button has grey/black styling distinct from the other buttons/tabs.",
        "Clicking the button triggers opening the Settings popup/modal (see REQ-2)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a Settings modal (popup) in the Admin Dashboard that opens when the \"⚙️ Settings\" button is clicked. The modal must contain a simple form with: (1) a labeled password input field with label text \"Gemini API Key\" (input type=password so the value is hidden), and (2) a button labeled \"Save Settings\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When I click the 'Settings' button, open a simple popup form. Input Field: Label it 'Gemini API Key'. Make it a password field (dots) so the key is hidden. Save Button: Add a 'Save Settings' button."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"⚙️ Settings\" opens a modal dialog.",
        "Modal contains a form field labeled \"Gemini API Key\" and the input uses password masking.",
        "Modal contains a primary action button labeled \"Save Settings\".",
        "If a value already exists in localStorage under \"gemini_api_key\", the field is prefilled with that value when opening the modal."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When the user clicks \"Save Settings\" in the Admin Dashboard Settings modal, store the entered API key value (trimmed) in browser Local Storage under the key \"gemini_api_key\". After saving, show a success message exactly: \"API Key Saved Successfully! ✅\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When I click 'Save', store the Key in Local Storage as gemini_api_key. Show a message: 'API Key Saved Successfully! ✅'. This key will be used by the Chatbot."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Save Settings\" writes the trimmed API key to localStorage key \"gemini_api_key\".",
        "A visible success notification/message appears with exact text: \"API Key Saved Successfully! ✅\".",
        "After saving, reopening the Settings modal shows the saved key value still present (read back from localStorage).",
        "No backend changes are required for saving; it is purely localStorage-based."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn components are read-only and must be composed).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Persist the API key only in browser localStorage under the exact key name \"gemini_api_key\"."
  ],
  "nonGoals": [
    "Do not store the Gemini API key in the Motoko backend canister or any server-side storage.",
    "Do not add third-party authentication or external secret management.",
    "Do not change the chatbot prompt/content behavior beyond ensuring it can read the key from localStorage (it already uses \"gemini_api_key\")."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}