{
  "kind": "build_request",
  "title": "Update client admin login password and ensure special-character, case-sensitive validation",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Client Admin login to use the new strong password exactly as provided: \"@ni#ra&j*gurja:r\" (replacing the current simple password).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Replace the current simple password with this specific new strong password: @ni#ra&j*gurja:r"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/hooks/useClientAdminAuth.ts, the hardcoded admin password is replaced with exactly \"@ni#ra&j*gurja:r\".",
        "Entering \"@ni#ra&j*gurja:r\" in the Client Admin login successfully unlocks and displays the admin panel/dashboard UI.",
        "Entering any other password does not unlock the admin panel/dashboard UI and shows the existing error message."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Client Admin login password input accepts special characters (including @, #, &, *, and :) and submits them unchanged for authentication comparison.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ensure the login input field accepts special characters like @, #, &, *, and : without any errors."
        ]
      },
      "acceptanceCriteria": [
        "The password input field in frontend/src/pages/ClientAdminPage.tsx allows typing and pasting special characters (@, #, &, *, :) without validation errors or character stripping.",
        "The value passed into useClientAdminAuth.login() matches exactly what the user typed (no trimming, sanitizing, or normalization that would remove/alter these characters)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure Client Admin password authentication remains strictly case-sensitive so that uppercase/lowercase letters must match exactly to unlock the admin panel/dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make sure the password logic is case-sensitive (capital and small letters must match exactly)."
        ]
      },
      "acceptanceCriteria": [
        "\"@ni#ra&j*gurja:r\" unlocks the admin panel/dashboard, while any variant with different letter casing does not unlock it.",
        "Authentication uses an exact string match (no case folding, no locale-based normalization)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text (e.g., validation/error messages)."
  ],
  "nonGoals": [
    "Do not add or change Internet Identity / backend admin authorization (backend isAdmin) flows for this request.",
    "Do not redesign the admin panel UI beyond what is required to accept and validate the new password."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}