{
  "kind": "build_request",
  "title": "Add a site-wide scrolling notice/ticker message in the header",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add a prominent, site-wide scrolling notice/ticker (marquee-style) at the top of the website (in the shared header layout) that continuously scrolls left-to-right or right-to-left and displays an English daily-update message indicating users do not need to update and should visit daily for new updates (e.g., \"No need to update — visit here daily for new updates.\"). The ticker must be visible on both the homepage and post detail pages and remain readable and mobile-friendly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "ऊपर एक पोस्ट चलना चाहिए जिस पर लिखा होना चाहिए नहीं पड़ती अपडेट करने के लिए यहां पर रोज आता है"
        ]
      },
      "acceptanceCriteria": [
        "A scrolling ticker/notice bar appears within the shared header area so it is visible on all routes (e.g., '/' and '/post/:postId').",
        "The ticker text is in English and conveys: no need to update; visit daily for updates.",
        "The ticker continuously animates (marquee-like) and is readable on mobile (no clipped text; adequate contrast).",
        "The ticker does not break the existing sticky header behavior and does not cause layout shift that hides page content behind the header."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not edit frontend immutable hook/entry files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Use English for any user-facing text added by this change."
  ],
  "nonGoals": [
    "Adding new backend data fields or changing the existing JobPost schema.",
    "Adding an admin panel/CMS to update ticker text.",
    "Adding third-party integrations (ads, analytics, external auth)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}