{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Prevent premature 'Access Denied' during admin status loading and improve non-admin guidance",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the admin route guard to render a dedicated loading state while `useIsAdmin()` is resolving, avoiding any 'Access Denied' flash/stuck state for legitimate admins.",
      "acceptanceCriteria": [
        "When a logged-in administrator navigates to `/admin`, `/admin/dashboard`, `/admin/posts`, or `/admin/posts/:id/edit`, the UI does not flash or get stuck on the 'Access Denied' message during the initial admin check.",
        "While `useIsAdmin()` is loading, the route guard shows a dedicated loading UI (not 'Access Denied').",
        "After the admin check resolves true, the protected page renders normally without requiring a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Use the authorization-driven `useIsAdmin()` hook state correctly: if Internet Identity is initializing or the admin check is loading, render a dedicated loading UI; only render AccessDeniedScreen for authenticated users after the admin check has resolved (false) or after a handled error state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AdminAuthLoadingScreen.tsx",
          "operation": "create",
          "description": "Create a simple, dedicated loading UI for admin route checks (e.g., title + short message + loading indicator) to be used by AdminRouteGuard during `useIsAdmin()` loading/initialization. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve the authenticated-but-not-admin access denied UX with clear next steps while keeping the login-required experience unchanged.",
      "acceptanceCriteria": [
        "If a user is authenticated but not an admin, the access denied screen provides a clear English next-step instruction.",
        "If a user is not authenticated, the screen continues to show the login-required UI with the login button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Enhance the `notAdmin` mode message to keep the existing English text and add clear next-step guidance (e.g., sign out and sign in with the admin identity, or contact the administrator). Preserve the current `loginRequired` UI and login button behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}