{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Client Admin password validation (special characters + case sensitivity)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the hardcoded Client Admin password with the new strong password string.",
      "acceptanceCriteria": [
        "In frontend/src/hooks/useClientAdminAuth.ts, the hardcoded admin password is replaced with exactly \"@ni#ra&j*gurja:r\".",
        "Entering \"@ni#ra&j*gurja:r\" in the Client Admin login successfully unlocks and displays the admin panel/dashboard UI.",
        "Entering any other password does not unlock the admin panel/dashboard UI and shows the existing error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useClientAdminAuth.ts",
          "operation": "modify",
          "description": "Update the CORRECT_PASSWORD constant to exactly \"@ni#ra&j*gurja:r\" and ensure the login comparison continues to use an exact match."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the Client Admin password input accepts special characters and passes the raw value unchanged to authentication.",
      "acceptanceCriteria": [
        "The password input field in frontend/src/pages/ClientAdminPage.tsx allows typing and pasting special characters (@, #, &, *, :) without validation errors or character stripping.",
        "The value passed into useClientAdminAuth.login() matches exactly what the user typed (no trimming, sanitizing, or normalization that would remove/alter these characters)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ClientAdminPage.tsx",
          "operation": "modify",
          "description": "Ensure the password field remains a plain controlled input (no pattern/minLength validation, no trimming/sanitization in onChange or submit). Confirm handleSubmit passes the password state directly into onLogin(password) unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep Client Admin password authentication strictly case-sensitive with exact string matching.",
      "acceptanceCriteria": [
        "\"@ni#ra&j*gurja:r\" unlocks the admin panel/dashboard, while any variant with different letter casing does not unlock it.",
        "Authentication uses an exact string match (no case folding, no locale-based normalization)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useClientAdminAuth.ts",
          "operation": "modify",
          "description": "Verify and preserve strict case-sensitive exact string comparison for the password check (no lowercasing/uppercasing/normalization); keep password equality as a direct string match."
        }
      ]
    }
  ]
}