{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Panel: in-page password unlock and gated dashboard controls",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the destructive 'Access Denied' alert from the Admin Panel unlock flow so it does not block access to the password input.",
      "acceptanceCriteria": [
        "Navigating to the Admin Panel no longer shows any red 'Access Denied' alert box.",
        "The password input is visible on the page when admin access is not yet unlocked."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Adjust the Admin Panel guard so that the client-side unlock step does not render the destructive AccessDeniedScreen (or any access-denied UI) while locked; instead, allow the Admin Panel page to render and show its in-page unlock form."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Ensure AccessDeniedScreen remains limited to genuine 'login required' / 'not admin' states and is not referenced/used by the Admin Panel client-unlock flow."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the modal-based admin password gate with a visible in-page 'Admin Login' form inside the Admin Panel page.",
      "acceptanceCriteria": [
        "When not unlocked, the Admin Panel shows an in-page form (not a dialog/modal) with the specified headline, placeholder, and button label.",
        "The 'Unlock Dashboard' button is visually styled as a prominent green primary action (e.g., Tailwind green background) and is larger than a typical small/secondary button.",
        "No modal is automatically opened for admin password entry (the existing auto-open modal behavior is removed from the Admin Panel flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminUnlockInlineForm.tsx",
          "operation": "create",
          "description": "Create a simple in-page admin unlock form component rendered directly in the Admin Panel page when locked. It must render headline text exactly 'Admin Login', a password input with placeholder exactly 'Enter Password', and a large green button labeled exactly 'Unlock Dashboard'."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Render the new in-page unlock form when the client admin session is not unlocked, and remove/avoid any modal-based password prompting within the Admin Panel page."
        },
        {
          "path": "frontend/src/components/auth/AdminPasswordRequiredScreen.tsx",
          "operation": "delete",
          "description": "Remove the auto-opening password modal screen so the Admin Panel no longer triggers modal/popup behavior for password entry."
        },
        {
          "path": "frontend/src/components/auth/AdminPasswordGateModal.tsx",
          "operation": "delete",
          "description": "Remove the modal-based admin password gate component to fully eliminate modal/popup password entry from the Admin Panel unlock flow."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement the in-page unlock logic: validate password, set localStorage 'isAdmin' to 'true', refresh the Admin Panel section, and alert 'Wrong Password' on failure.",
      "acceptanceCriteria": [
        "Entering the correct password sets localStorage key 'isAdmin' to string value 'true' and the Admin Panel switches to show the dashboard content without requiring a full page reload.",
        "Entering an incorrect password triggers window.alert('Wrong Password') exactly.",
        "The local client-side admin auth hook/logic does not emit 'Wrong Password!' (with an exclamation) anywhere in the Admin Panel flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useClientAdminAuth.ts",
          "operation": "modify",
          "description": "Update client admin auth logic so failed login triggers window.alert('Wrong Password') exactly (no exclamation), and successful login sets localStorage.setItem('isAdmin','true') and notifies subscribers so the Admin Panel updates without a full page reload."
        },
        {
          "path": "frontend/src/components/admin/AdminUnlockInlineForm.tsx",
          "operation": "modify",
          "description": "Wire the form submit/button click to call the client admin auth login method and clear/reset the password field appropriately on success/failure."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Subscribe to client admin unlock state (via useClientAdminAuth) so the dashboard content swaps immediately after successful unlock, without navigating away or reloading the page."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Hide Admin Panel dashboard controls until successfully unlocked; show 'Job Posts', 'Settings', and 'Manage Quiz' controls only after unlock and hide again on logout/flag clear.",
      "acceptanceCriteria": [
        "When not unlocked, the Admin Panel does not render the dashboard navigation/actions for 'Job Posts', 'Settings', or 'Manage Quiz'.",
        "After a successful unlock, the Admin Panel renders those dashboard navigation/actions normally.",
        "Logging out (or clearing the unlock flag) hides those controls again and returns to the in-page login form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Gate rendering of the dashboard navigation/actions (including the controls for 'Job Posts', 'Settings', and 'Manage Quiz') behind the unlocked state; when locked, render only the in-page unlock form. Ensure logout clears the unlock flag and returns the view to the unlock form."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Ensure the route guard does not render dashboard controls while locked and delegates locked UI to the Admin Panel page (so the page can hide controls and show the in-page unlock form consistently)."
        }
      ]
    }
  ]
}